{
	"name":{
		"tooltip": "This is the Suite name or ID. Katana will save the Suite with this name.",
		"protip": "",
		"bantip": "No spaces or special characters but for the exception of underscores, hyphens, and periods",
		"snowflake": "This is a mandatory field"
	},
	"title":{
		"tooltip": "A short description about this Suite",
		"protip": "ProTip: Write down something distinct about this Suite here so that it would be easier to understand what this Suite is about when you come back to it later",
		"bantip": "",
		"snowflake": "This is a mandatory field."
	},
	"directory": {
		"tooltip": "Enter directory path if a specific location should be used to save the results.",
		"protip": "",
		"bantip": "",
		"snowflake": "If left blank to use Warrior default results directory which is the Execution folder in Warriorspace."
	},
	"path":{
		"tooltip": "Path to the Case.",
		"protip": "ProTip: Use relative path so that the Suite becomes independent of the system on which it is run",
		"bantip": "",
		"snowflake": "Relative path is supported."
	},
	"requirement":{
		"tooltip": "Enter requirements for this test suite if applicable. Multiple requirements can be entered.",
		"protip": "",
		"bantip": "",
		"snowflake": ""
	},
	"type":{
		"tooltip": "This indicates the way in which the Cases in this Suite would run: sequential_testcases - all the Cases will be executed in sequence. parallel_testcases - all the Cases will be executed in parallel. Run_Multiple - the entire Suite will be executed as many times as indicated. Run_Until_Fail/Run_Until_Pass - the entire suite will be continuously executed until the either suite Fails/Passes or the max attempts is reached.",
		"protip": "ProTip: Select sequential_testcases if you are unsure about what to do. This would run the Cases in this Suite, one after the other.",
		"bantip": "",
		"snowflake": ""
	},
	"defaultError":{
		"tooltip": "This is where you set what happens if a Case fails. You will be able to set different onError setting per Case if needed. That will be done in the Cases case section below.",
		"protip": "",
		"bantip": "",
		"snowflake": "When set, this becomes the default for all Case-steps below. The default is 'next'"
	},
	"goto":{
		"tooltip": "Specify which Case to go to in case of error.",
		"protip": "ProTip: Be careful while setting this value to a step that is above the current step; you can get stuck in an infinite loop.",
		"bantip": "",
		"snowflake": ""
	},
	"resultsDirectory":{
		"tooltip": "Location of directory where result files will be stored.",
		"protip": "",
		"bantip": "",
		"snowflake": "If field is left blank Warrior will use the default location under the Execution folder of the Warriorspace."
	},
	"context":{
		"tooltip": "Indicates if the Case is a positive or negative test scenario.",
		"protip": "ProTip: The scenarios that should fail can be assessed as 'PASS' when the context is switched to negative.",
		"bantip": "",
		"snowflake": ""
	},
	"runType":{
		"tooltip": "Indicate how the keywords within the Case will be executed. If sequential_keywords is selected, the keywords within the Case will all run in sequence. If the parallel_keywords is selected, then the keywords within the test case will all run in parallel.",
		"protip": "ProTip: Select sequential_keywords if you are unsure about what to do. This would run the keywords in this Case one after the other.",
		"bantip": "",
		"snowflake": ""
	},
	"onErrorAction":{
		"tooltip": "Set what happens if the Case fails. This will override the default of the Suite.",
		"protip": "",
		"bantip": "",
		"snowflake": "The default is what has been set as 'Default On Error' above in the Suite section"
	},
    "engineer":{
		"tooltip": "This field should contain the name of the Engineer who created and/or edited this Suite. ",
		"protip": "",
		"bantip": "",
		"snowflake": "This is a mandatory field"
	},
    "time":{
		"tooltip": "This is date & time on which this Suite was created and/or last updated",
		"protip": "",
		"bantip": "",
		"snowflake": "This field cannot be edited as this is a datetime-stamp."
	},
	"impact":{
		"tooltip": "This field will determines if the status of Case will or will not impact the Suite status.",
		"protip": "",
		"bantip": "Do not set this to 'noimpact' if the Run Mode is being set to anything other than 'Standard'.",
		"snowflake": ""
	},
	"runmode":{
		"tooltip": "Specifies the way in which this Case should run. 'RMT (Run Multiple Times)' would run this Case for the specified number of times. 'RUP (Run Until Pass)' would run this Case until the Case passes. 'RUF (Run Until Failure)' would run the Case until it fails. Standard would run the Case once.",
		"protip": "",
		"bantip": "",
		"snowflake": ""
	},
	"runmode_value":{
		"tooltip": "For RMT, the Case will run for the specified number of times. For RUP, this would be the maximum number of times the Case runs before it finally fails the Case. For 'RUF', this would be the maximum number of times the Case runs to see if the Case fails.",
		"protip": "",
		"bantip": "This field takes in only numerical values. No alphabets, spaces, or special characters.",
		"snowflake": ""
	},
	"inputDataFile":{
		"tooltip": "You can provide a path to the Input Data File here.",
		"protip": "ProTip: A relative path to the data file is recommended so that the Case becomes generic.",
		"bantip": "",
		"snowflake": "Relative Path is supported"
	},
	"suitestate":{
		"tooltip": "This indicates the current state the Suite is in - new, test-assigned, released, and so on.",
		"protip": "Protip: Adding a state to a Suite keeps track of which stage of development the Suite is in. New states can be added by selecting the 'Add Another' field in the dropdown menu.",
		"bantip": "No spaces or special characters.",
		"snowflake": "If the Suite is in the 'New' state, you would be able to create a skeletal Suite i.e. a Suite without a single Case; otherwise, a Suite requires at least one Case."
	},
	"jocketFile": {
        "tooltip": "You can provide a path to the TestWrapper File here.",
        "protip": "ProTip: A relative path to the TestWrapper file is recommended so that the Case becomes generic.",
        "bantip": "",
        "snowflake": ""
    },
	"executeType_nonzero":{
		"tooltip": "Decides if this Case should be executed. Yes and No let you directly state whether you want to execute this Case. If and If Not gives you the capabilities for executing the Case when certain conditions are met.",
		"protip": "ProTip: If want to execute this Case if an existing condition is met, the choose 'If'. If want to execute this Case if an existing condition is NOT met, the choose 'If Not'.",
		"bantip": "",
		"snowflake": ""
	},
	"executeType_zero":{
		"tooltip": "Decides if this Case should be executed. Yes and No let you directly state whether you want to execute this Case.",
		"protip": "",
		"bantip": "",
		"snowflake": ""
	},
    "condition":{
        "tooltip": "This is the condition field for Execute Types 'If' and 'If Not'. If you want to execute this Case based on he result of a previously executed Case, then the syntax is testcase_<case_number>_status.",
        "protip": "",
        "bantip": "While adding a condition that executes this Case based on a previously executed Case, the scope is limited to the Cases in this Suite. Do not add a condition trying to access a Case status from any other Suite but this one.",
        "snowflake": "This is a mandatory field."
    },
    "conditionValue":{
        "tooltip": "This is the value for the condition given above",
        "protip": "",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "else":{
        "tooltip": "This field is the 'Else' field for the 'If'/'If Not' above. This works similar to the 'On Error' field, you can choose between 'next', 'abort', and 'goto'.",
        "protip": "ProTip: You should select 'abort' if you know that the failure of the condition above means nothing from this point onwards is going to Pass.",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "elseValue":{
        "tooltip": "This is Case that you want to go to in case that the condition above is not met",
        "protip": "ProTip: If you are selecting to go to a Case above the current Case, you may get stuck in an infinite loop.",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "insertcase": {
        "tooltip": "Click this to insert a case below",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
	"editTC": {
		"tooltip": "Click this to edit this Case.",
        "protip": "",
        "bantip": "",
        "snowflake": "You can edit only one Case at a time."
	},
    "deleteTC": {
        "tooltip": "Click this to delete this Case.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    }
}