{
    "name": {
        "tooltip": "This is the Case name. Katana will save this Case with the name provided in this field",
        "protip": "",
        "bantip": "No spaces or special characters but for the exception of underscores, hyphens, and periods",
        "snowflake": "This is a mandatory field"
    },
    "title": {
        "tooltip": "Provide a description of the Case here.",
        "protip": "ProTip: Providing a description helps in understanding what this Case is about when you come back to it after a while.",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "category": {
        "tooltip": "In this field, you can specify the category to which this Case belongs.",
        "protip": "ProTip: Categorization of Cases helps in creating Suites through a CLI later.",
        "bantip": "No spaces or special characters.",
        "snowflake": "This is an optional field."
    },
    "tc_state": {
        "tooltip": "This indicates the current state the Case is in - new, test-assigned, released, and so on.",
        "protip": "Protip: Adding a state to a Case keeps track of which stage of development the Case is in.",
        "bantip": "No spaces or special characters.",
        "snowflake": "New states can be added by selecting the 'Add Another' field in the dropdown menu."
    },
    "engineer": {
        "tooltip": "This field should contain the name of the Engineer who created and/or edited this Case. ",
        "protip": "",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "datetime": {
        "tooltip": "This is date & time on which this Case was created and/or last updated",
        "protip": "",
        "bantip": "",
        "snowflake": "This field cannot be edited as this is a datetime-stamp."
    },
    "defaultError": {
        "tooltip": "This is where you set what happens if a keyword fails.",
        "protip": "",
        "bantip": "",
        "snowflake": "When set, this becomes the default for all steps below."
    },
    "inputDataFile": {
        "tooltip": "You can provide a path to the Input Data File here.",
        "protip": "ProTip: A relative path to the data file is recommended so that the Case becomes generic.",
        "bantip": "",
        "snowflake": ""
    },
    "TestWrapperFile": {
        "tooltip": "You can provide a path to the TestWrapper File here.",
        "protip": "ProTip: A relative path to the TestWrapper file is recommended so that the Case becomes generic.",
        "bantip": "",
        "snowflake": ""
    },
    "datatype": {
        "tooltip": "The value in the field determines the interaction of the Case with the data file. Iterative - in this mode, the Case would interact with all the systems in the datafile. Custom - the Case would only interact with the specified system in the datafile. Hybrid - This is a combination of the Iterative and Custom modes.",
        "protip": "ProTip: If you are not sure what to select, choose Custom so that you have control over which keyword interacts with which system in the data file.",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "logDirectory": {
        "tooltip": "You can enter a directory path if you need to use a specific location for storing the log files.",
        "protip": "",
        "bantip": "",
        "snowflake": "If this field is left empty, the default path that has been specified by Warrior would be used"
    },
    "resultsDirectory": {
        "tooltip": "You can enter a directory path if you need to use a specific location for storing the result files.",
        "protip": "",
        "bantip": "",
        "snowflake": "If this field is left empty, the default path that has been specified by Warrior would be used."
    },
    "expectedresult": {
        "tooltip": "This field is for your information. You can enter what results are expected out of this Case here.",
        "protip": "ProTip: You can enter the action to take in Case of errors in this field. This helps in keeping track of the debug steps in case something goes wrong.",
        "bantip": "",
        "snowflake": ""
    },
    "reqeditor":{
        "tooltip": "You can enter as many applicable requirements for this Case as you need here.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "edit": {
        "tooltip": "Click here to edit this step.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "driver": {
        "tooltip": "Select the Product Driver from the list of Product Drivers available to you.",
        "protip": "ProTip: If a driver you want has not been developed yet, you can check the box 'To be developed'. You will then be able to enter a driver name of your choice.",
        "bantip": "",
        "snowflake": "This field is mandatory only if the 'To be developed' checkbox has NOT been checked."
    },
    "keyword": {
        "tooltip": "Select the Keyword that you want for this step. If a keyword that you want has not been developed yet, you can check the box 'To be developed'. You will then be able to enter a keyword name of your choice.",
        "protip": "ProTip: Unsure what this keyword does? Select it and the documentation for it would appear on the side.",
        "bantip": "",
        "snowflake": "If selecting from a list of available drivers and keywords, you will need to select the driver before you can select a keyword. This is a mandatory field."
    },
    "description": {
        "tooltip": "This is the description for the step.",
        "protip": "ProTip: You can add a short description so that you can keep a track of what this step intends to do.",
        "bantip": "",
        "snowflake": ""
    },
    "wdescription": {
        "tooltip": "This is the WDescription for the selected Keyword.",
        "protip": "",
        "bantip": "This field cannot be edited.",
        "snowflake": ""
    },
    "steparg": {
        "tooltip": "These are all the arguments accepted by the keyword above. System & subsytem will be auto-populated from the Input datafile(should be provided with correct path before the step creation). System name with no subsystem will only render the system name field and not subsystem name field.",
        "protip": "ProTip: If you want to know which arguments are mandatory and which are not or if you want to know the default value of the non-mandatory arguments, you can go through the signature of the keyword in the signature and comment section.",
        "bantip": "",
        "snowflake": "If you can't see anything here, you probably have not selected a keyword."
    },
    "exectype": {
        "tooltip": "Decides if this step should be executed. Yes and No let you directly state whether you want to execute this step. If and If Not gives you the capabilities for executing the step when certain conditions are met.",
        "protip": "ProTip: If want to execute this step if an existing condition is met, the choose 'If'. If want to execute this step if an existing condition is NOT met, the choose 'If Not'.",
        "bantip": "",
        "snowflake": ""
    },
    "expression": {
        "tooltip": "The expression is a logical expression. Logical operators supported are: & AND | OR . Regular expression is not supported.Examples: 1 | 2 | 3 | 4 should be used for Rule1 OR Rule2 OR Rule3 OR Rule4. (1|2) & 3 should be used for (Rule 1 OR Rule 2) and then the result will be used with AND Rule 3",
        "protip": "ProTip: If Expression field is left blank, Warrior will assume an AND operation for all the rules.",
        "bantip": "If you want to compute or for all 4 rules, then expression text box shall be filled with 1 | 2 | 3 | 4. If you want to compute AND between (rule-1, rule-3), (rule-2,rule-4) and OR between the computed ANDs, then expression text box shall be filled with (1&3) | (2&4)",
        "snowflake": ""
    },
    "execelse": {
        "tooltip": "This field is the top level else which executes when the 'expression' fails. This works similar to the 'On Error' field, you can choose between 'next', 'abort', and 'goto'.",
        "protip": "ProTip: You should select 'abort' if you know that the failure of the condition above means nothing from this point onwards is going to Pass.",
        "bantip": "",
        "snowflake": ""
    },
    "execelseval": {
        "tooltip": "This is step that you want to go to in case the rule is not met",
        "protip": "ProTip: If you are selecting to go to a step above the current step, you may get stuck in an infinite loop.","protip": "",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "condition": {
        "tooltip": "This is the condition field for Execute Types 'If' and 'If Not'. If you want to execute this step based on he result of a previously executed step, then the syntax is step_<step_number>_result.",
        "protip": "ProTip: For conditions other than previous step status, you can check what is available for you to access by going through the keyword documentation and checking out the ':Returns:' section at the bottom.",
        "bantip": "While adding a condition that executes this step based on a previously executed step, the scope is limited to the steps in this Case. Do not add a condition trying to access a step status from any other Case but this one.",
        "snowflake": "This is a mandatory field."
    },
    "operator": {
        "tooltip": "This supports multiple inequalities between condition and condition value.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "condvalue": {
        "tooltip": "This is the value for the condition given above",
        "protip": "ProTip: If you have entered a step status above, this field should contain one of these values: 'PASS', 'FAIL', 'ERROR', 'EXCEPTION'.",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "condelse": {
        "tooltip": "This field is the 'Else' field for the particular Rule. This works similar to the 'On Error' field, you can choose between 'next', 'abort', and 'goto'.",
        "protip": "ProTip: You should select 'abort' if you know that the failure of the condition above means nothing from this point onwards is going to Pass.",
        "bantip": "",
        "snowflake": ""
    },
    "condelsevalue": {
        "tooltip": "This is step that you want to go to in case that the condition above is not met",
        "protip": "ProTip: If you are selecting to go to a step above the current step, you may get stuck in an infinite loop.",
        "bantip": "",
        "snowflake": "This is a mandatory field."
    },
    "iter_type": {
        "tooltip": "Iteration Type can be set to exclude a step from iterations. Standard denotes the standard way, OPT denotes 'One per Testcase', and OPI denotes 'Once per Iteration'",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "runmodes": {
        "tooltip": "Specifies the way in which this keyword should run. 'RMT (Run Multiple Times)' would run this keyword for the specified number of times. 'RUP (Run Until Pass)' would run this keyword until the keyword passes. 'RUF (Run Until Failure)' would run the keyword until it fails. Standard would run the keyword once.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "runmodes_value": {
        "tooltip": "For RMT, the keyword will run for the specified number of times. For RUP, this would be the maximum number of times the keyword runs before it finally fails the keyword. For 'RUF', this would be the maximum number of times the keyword runs to see if the keyword fails.",
        "protip": "",
        "bantip": "This field takes in only numerical values. No alphabets, spaces, or special characters.",
        "snowflake": ""
    },
    "impact": {
        "tooltip": "This field will determines if the status of step will or will not impact the Case status.",
        "protip": "",
        "bantip": "Do not set this to 'noimpact' if the Run Mode is being set to anything other than 'Standard'.",
        "snowflake": ""
    },
    "context": {
        "tooltip": "Indicates a positive or negative test scenario.",
        "protip": "ProTip: The scenarios that should fail can be assessed as 'PASS' when the context is switched to negative.",
        "bantip": "",
        "snowflake": ""
    },
    "stepDefaultError": {
        "tooltip": "This is where you set what happens if a keyword fails.",
        "protip": "ProTip: If you know a failure in this step is going to crumble the entire Case (eg: this step connects to a system), set this field to 'abort', so that if a failure occurs, the execution of the Case is suspended then and there.",
        "bantip": "",
        "snowflake": "On selecting 'goto', a new field would appear which will let you enter which step you want to go to in case of an error in this step."
    },
    "stepgoto": {
        "tooltip": "Specify which step to go to in case of error",
        "protip": "ProTip: Be careful while setting this value to a step that is above the current step; you can get stuck in an infinite loop.",
        "bantip": "",
        "snowflake": ""
    },
    "stepsave": {
        "tooltip": "This would save this step in the Step Grid above.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "stepcancel": {
        "tooltip": "Clicking on this button will hide & clear the step editor",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "stepnew": {
        "tooltip": "Create a new step.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "tobedevelopedwarn": {
        "tooltip": "This is a draft step. The keyword and/or driver contained in this step is yet to be developed.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "deletestep": {
        "tooltip": "Click this to delete this step.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "editstep": {
        "tooltip": "Click this to edit this step.",
        "protip": "",
        "bantip": "",
        "snowflake": "You can edit only one step at a time."
    },
    "insertstep": {
        "tooltip": "Click this to insert a step below",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "contextsteppositive": {
        "tooltip": "This end status of this step will be evaluated in a positive context",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    },
    "contextstepnegative": {
        "tooltip": "This end status of this step will be evaluated in a negative context, i.e., if the step passes, it would evaluated as a failure and if the step fails, it would be evaluated as a pass.",
        "protip": "",
        "bantip": "",
        "snowflake": ""
    }
}
